### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
import numpy as np
data = np.array([4, 8, 15, 16, 23, 42])
s = pd.Series(data, name = " Series Data")
s

0     4
1     8
2    15
3    16
4    23
5    42
Name:  Series Data, dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
import pandas as pd

l = list(range(0, 11))
s = pd.Series(l)
s

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data: , Then, print the DataFrame.

In [8]:
import pandas as pd

name = ["Alice", "Bob", "Clarie"]
age = [25, 30, 27]
gender = ["Female", "Male", "Female"]
df = pd.DataFrame({"Name" : name, "Age" : age, "Gender" : gender})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

	In pandas, a DataFrame is a two-dimensional labeled data structure that can store data of different types (e.g., numbers, strings, etc.) in a tabular format. It is similar to a table in a relational database or a spreadsheet, where data is organized into rows and columns. Each column in a DataFrame is represented by a pandas Series, but a DataFrame can contain multiple columns.
    
    A pandas Series, on the other hand, is a one-dimensional labeled array that can store data of a single data type. It represents a single column or row of data in a DataFrame.

In [10]:
import pandas as pd

data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Paris', 'London']
}

df = pd.DataFrame(data)
print(df)

print("\n")

# Access a column as a Series
age_series = df['Age']
print(age_series)

    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London


0    25
1    30
2    35
Name: Age, dtype: int64

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

	head() and tail(): These functions allow you to view the first or last few rows of a DataFrame. They are useful for getting a quick overview of the data.

	info(): This function provides information about the DataFrame, including the number of rows, columns, data types, and memory usage. It helps in understanding the structure of the data.

	describe(): This function generates descriptive statistics of the numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartiles.
    
    Etc

In [13]:
import pandas as pd

data = {
    'Name': ['John', 'Alice', 'Bob', "lol", "lil", "filly"],
    'Age': [25, 30, 35 , 40, 45, 46],
    'City': ['New York', 'Paris', 'London', 'New York', 'Paris', 'London']
}

df = pd.DataFrame(data)

In [14]:
df.head()

    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   35    London
3    lol   40  New York
4    lil   45     Paris

In [15]:
df.tail()

    Name  Age      City
1  Alice   30     Paris
2    Bob   35    London
3    lol   40  New York
4    lil   45     Paris
5  filly   46    London

In [16]:
df.describe()

             Age
count   6.000000
mean   36.833333
std     8.376555
min    25.000000
25%    31.250000
50%    37.500000
75%    43.750000
max    46.000000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

	Series: Immutable
	DataFrame: Mutable
	Panel: Immutable

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
import pandas as pd
# Create Series objects
series1 = pd.Series([1, 2, 3, 4, 5], name='A')
series2 = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'], name='B')
series3 = pd.Series([0.1, 0.2, 0.3, 0.4, 0.5], name='C')

# Create DataFrame using the Series
df = pd.DataFrame({'Column1': series1, 'Column2': series2, 'Column3': series3})

print(df)

   Column1     Column2  Column3
0        1       apple      0.1
1        2      banana      0.2
2        3      cherry      0.3
3        4        date      0.4
4        5  elderberry      0.5